In [44]:
import pandas as pd
import numpy as np

In [14]:
data = pd.read_csv("V:/VikasSharma/DataCamp/AV/HR Analytics/train_LZdllcl.csv")

In [15]:
data.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted
0,65438,Sales & Marketing,region_7,Master's & above,f,sourcing,1,35,5.0,8,1,0,49,0
1,65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,0,60,0
2,7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,0,50,0
3,2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,0,50,0
4,48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,0,73,0

In [16]:
data.shape

(54808, 14)

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54808 entries, 0 to 54807
Data columns (total 14 columns):
employee_id             54808 non-null int64
department              54808 non-null object
region                  54808 non-null object
education               52399 non-null object
gender                  54808 non-null object
recruitment_channel     54808 non-null object
no_of_trainings         54808 non-null int64
age                     54808 non-null int64
previous_year_rating    50684 non-null float64
length_of_service       54808 non-null int64
KPIs_met >80%           54808 non-null int64
awards_won?             54808 non-null int64
avg_training_score      54808 non-null int64
is_promoted             54808 non-null int64
dtypes: float64(1), int64(8), object(5)
memory usage: 5.9+ MB

In [19]:
data.describe()

,employee_id,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted
count,54808.000000,54808.000000,54808.000000,50684.000000,54808.000000,54808.000000,54808.000000,54808.000000,54808.000000
mean,39195.830627,1.253011,34.803915,3.329256,5.865512,0.351974,0.023172,63.386750,0.085170
std,22586.581449,0.609264,7.660169,1.259993,4.265094,0.477590,0.150450,13.371559,0.279137
min,1.000000,1.000000,20.000000,1.000000,1.000000,0.000000,0.000000,39.000000,0.000000
25%,19669.750000,1.000000,29.000000,3.000000,3.000000,0.000000,0.000000,51.000000,0.000000
50%,39225.500000,1.000000,33.000000,3.000000,5.000000,0.000000,0.000000,60.000000,0.000000
75%,58730.500000,1.000000,39.000000,4.000000,7.000000,1.000000,0.000000,76.000000,0.000000
max,78298.000000,10.000000,60.000000,5.000000,37.000000,1.000000,1.000000,99.000000,1.000000

The above stats summarizes the data. We can see that most of the people have done 1 training and the highest value being 10, similarly there is one record where the length of service is 37 years it would be interesting to see if this is by chance or a real value as it might influence our analysis. Before that let's have a look at the categorical variables as well.

In [20]:
# We would use describe method again but this to get a summary of non numerical variables
data.describe(include = "object")

               department    region   education gender recruitment_channel
count               54808     54808       52399  54808               54808
unique                  9        34           3      2                   3
top     Sales & Marketing  region_2  Bachelor's      m               other
freq                16840     12343       36669  38496               30446

Looking at the above table we know that department has 9 different categories, region has 34, education 3 and recruitment channel has 3 categories. The info however doesn't give us much detais about the contents of these variables, to get more insights we would use value_counts function.

In [24]:
data["department"].value_counts(normalize= True, dropna = False)

Sales & Marketing    0.307254
Operations           0.207050
Technology           0.130236
Procurement          0.130236
Analytics            0.097650
Finance              0.046271
HR                   0.044118
Legal                0.018957
R&D                  0.018227
Name: department, dtype: float64

In [25]:
data["region"].value_counts(normalize= True, dropna = False)

region_2     0.225204
region_22    0.117282
region_7     0.088363
region_15    0.051233
region_13    0.048314
region_26    0.041235
region_31    0.035305
region_4     0.031072
region_27    0.030269
region_16    0.026730
region_28    0.024048
region_11    0.023993
region_23    0.021438
region_29    0.018136
region_32    0.017242
region_19    0.015947
region_20    0.015509
region_14    0.015089
region_25    0.014943
region_17    0.014523
region_5     0.013976
region_6     0.012589
region_30    0.011987
region_8     0.011951
region_10    0.011823
region_1     0.011130
region_24    0.009269
region_12    0.009123
region_9     0.007663
region_21    0.007499
region_3     0.006313
region_34    0.005328
region_33    0.004908
region_18    0.000566
Name: region, dtype: float64

In [26]:
 data["education"].value_counts(normalize= True, dropna = False)

Bachelor's          0.669045
Master's & above    0.272314
NaN                 0.043953
Below Secondary     0.014688
Name: education, dtype: float64

In [27]:
 data["gender"].value_counts(normalize= True, dropna = False)

m    0.702379
f    0.297621
Name: gender, dtype: float64

In [28]:
 data["recruitment_channel"].value_counts(normalize= True, dropna = False)

other       0.555503
sourcing    0.423661
referred    0.020836
Name: recruitment_channel, dtype: float64

In [30]:
# Also the is-promoted is numeric in nature but we need to make it categorical 
data.is_promoted = data.is_promoted.astype("object")

In [31]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54808 entries, 0 to 54807
Data columns (total 14 columns):
employee_id             54808 non-null int64
department              54808 non-null object
region                  54808 non-null object
education               52399 non-null object
gender                  54808 non-null object
recruitment_channel     54808 non-null object
no_of_trainings         54808 non-null int64
age                     54808 non-null int64
previous_year_rating    50684 non-null float64
length_of_service       54808 non-null int64
KPIs_met >80%           54808 non-null int64
awards_won?             54808 non-null int64
avg_training_score      54808 non-null int64
is_promoted             54808 non-null object
dtypes: float64(1), int64(7), object(6)
memory usage: 5.9+ MB

In [33]:
data.is_promoted.value_counts(normalize=True)

0    0.91483
1    0.08517
Name: is_promoted, dtype: float64

The most of inportant part of any analysis is to be able to slice and dice the data table, so in the below section I just introduced the procedure of that which is pretty straightforward.

In [37]:
# slicing the data by column name
data.loc[0:20, "department":"gender"] # method 1 using loc

           department     region         education gender
0   Sales & Marketing   region_7  Master's & above      f
1          Operations  region_22        Bachelor's      m
2   Sales & Marketing  region_19        Bachelor's      m
3   Sales & Marketing  region_23        Bachelor's      m
4          Technology  region_26        Bachelor's      m
5           Analytics   region_2        Bachelor's      m
6          Operations  region_20        Bachelor's      f
7          Operations  region_34  Master's & above      m
8           Analytics  region_20        Bachelor's      m
9   Sales & Marketing   region_1  Master's & above      m
10         Technology  region_23               NaN      m
11  Sales & Marketing   region_7        Bachelor's      f
12  Sales & Marketing   region_4        Bachelor's      m
13         Technology  region_29  Master's & above      m
14                R&D   region_2  Master's & above      m
15         Operations   region_7        Bachelor's      m
16         Technology   region_2        Bachelor's      m
17  Sales & Marketing  region_31        Bachelor's      m
18  Sales & Marketing  region_31        Bachelor's      m
19         Operations  region_15        Bachelor's      m
20        Procurement  region_14        Bachelor's      m

In [39]:
data[0:20][["department","region","education","gender"]] # method 2 usinng just the basic stuff

           department     region         education gender
0   Sales & Marketing   region_7  Master's & above      f
1          Operations  region_22        Bachelor's      m
2   Sales & Marketing  region_19        Bachelor's      m
3   Sales & Marketing  region_23        Bachelor's      m
4          Technology  region_26        Bachelor's      m
5           Analytics   region_2        Bachelor's      m
6          Operations  region_20        Bachelor's      f
7          Operations  region_34  Master's & above      m
8           Analytics  region_20        Bachelor's      m
9   Sales & Marketing   region_1  Master's & above      m
10         Technology  region_23               NaN      m
11  Sales & Marketing   region_7        Bachelor's      f
12  Sales & Marketing   region_4        Bachelor's      m
13         Technology  region_29  Master's & above      m
14                R&D   region_2  Master's & above      m
15         Operations   region_7        Bachelor's      m
16         Technology   region_2        Bachelor's      m
17  Sales & Marketing  region_31        Bachelor's      m
18  Sales & Marketing  region_31        Bachelor's      m
19         Operations  region_15        Bachelor's      m

In [42]:
data[data.is_promoted == 0][0:20][["department","region","education","gender","is_promoted"]] # applying multiple filters all at once

           department     region         education gender is_promoted
0   Sales & Marketing   region_7  Master's & above      f           0
1          Operations  region_22        Bachelor's      m           0
2   Sales & Marketing  region_19        Bachelor's      m           0
3   Sales & Marketing  region_23        Bachelor's      m           0
4          Technology  region_26        Bachelor's      m           0
5           Analytics   region_2        Bachelor's      m           0
6          Operations  region_20        Bachelor's      f           0
7          Operations  region_34  Master's & above      m           0
8           Analytics  region_20        Bachelor's      m           0
9   Sales & Marketing   region_1  Master's & above      m           0
10         Technology  region_23               NaN      m           0
12  Sales & Marketing   region_4        Bachelor's      m           0
13         Technology  region_29  Master's & above      m           0
14                R&D   region_2  Master's & above      m           0
15         Operations   region_7        Bachelor's      m           0
16         Technology   region_2        Bachelor's      m           0
17  Sales & Marketing  region_31        Bachelor's      m           0
18  Sales & Marketing  region_31        Bachelor's      m           0
19         Operations  region_15        Bachelor's      m           0
20        Procurement  region_14        Bachelor's      m           0

In [45]:
pwd()

u'C:\\Users\\SharVi04'